# ****************************************************************分割线****************************************************************
# todo 递归

# 递归求斐波那契数列前10项
# 斐波那契数列：从第3项开始，每一项等于前两项之和
# 1 1 f(1)
# 2 1 f(2)
# 3 2 f(3)=f(2)+f(1)
# 4 3 f(4)=f(3)+f(2)
# 递归的核心：自己调用自己
# 缺点：从第3项开始，每一项会把求过的结果再求一遍，浪费时间（fixme 用动态规划优化）
# fixme 递归展开

import sys

# 求斐波那契数列每一项
def f(i):
    if i is None or i < 1:
        print("输入错误")
        sys.exit(0)
    elif i == 1 or i == 2:
        return 1
    else:
        return f(i - 1) + f(i - 2)

sum = 0
for i in range(1, 11):
    print(str(i) + ":" + str(f(i)))
    sum += f(i)
print(sum)
