# ****************************************************************分割线****************************************************************
# todo 冒泡排序

# 时间复杂度：最坏O(n^2)，最好O(n)
# 外层需要循环n-1次
# 内层至多需要比较n-1次，至多需要交换n-1对元素
# 时间复杂度T(n)=O(2(n-1)^2)=O(2n^2-4n+2)=O(2n^2)=O(n^2)
#
# 常数O(1)
# 线性O(n)
# 多项式O(polynomial(n))
# 对数O(logn)
# 指数O(2^n)：指数算法不是有效算法

list = [9, 8, 7, 6, 5, 4, 3, 2, 1]
i = 0
while i < len(list):  # 外层循环要比较的数
    j = 0
    while j < len(list) - 1:  # 内层循环要比较的次数
        if list[j] > list[j + 1]:
            temp = list[j]
            list[j] = list[j + 1]
            list[j + 1] = temp
        j += 1
    i += 1
print(list)
